Merge branch 'dev' into 'main'
docs: update README.md with correct paths to website/docs

See merge request de-team/hanas-docs!12
